{
  "breakingNews": [
    "President Marcos addresses the nation on economic recovery plans",
    "Iglesia ni Cristo holds National Rally for Peace with 1.5 million attendees",
    "Supreme Court declares Articles of Impeachment vs VP Sara Duterte as unconstitutional",
    "OFW remittances reach all-time high this quarter",
    "Renewable energy projects accelerate nationwide development",
    "Filipino scientists develop breakthrough cancer treatment",
    "Gilas Pilipinas prepares for FIBA World Cup qualifiers",
    "BARMM government launches massive infrastructure development program",
    "Philippine Stock Exchange hits record high amid foreign investor confidence",
    "Department of Health reports significant decline in COVID-19 cases nationwide",
    "DOST unveils new satellite technology for disaster monitoring",
    "Bangko Sentral ng Pilipinas maintains key interest rates at current levels",
    "Philippine Navy receives new frigates to strengthen maritime security",
    "DENR announces expanded marine protected areas in Palawan",
    "DepEd implements new digital learning platforms in public schools",
    "DOTr fast-tracks completion of Metro Manila subway project",
    "Philippine delegation secures major trade deals at ASEAN summit"
  ],
  "availableTags": [
    "Politics",
    "National",
    "International",
    "National Security",
    "Legal",
    "Business",
    "Technology",
    "Sports",
    "Lifestyle",
    "Environment",
    "Science",
    "Finance",
    "Entertainment",
    "Health"
  ],
  "articleOverrides": {
    "mock-business-1": {
      "title": "Global Markets Rally as Central Banks Signal Policy Shifts",
      "excerpt": "Major stock indices surge following coordinated statements from Federal Reserve and European Central Bank regarding interest rate adjustments. The Dow Jones gained 2.3% while the S&P 500 reached new highs as investors anticipate more accommodative monetary policies. Market analysts suggest this could mark the beginning of a sustained bull run driven by improved economic outlook and corporate earnings growth.",
      "content": "Financial markets experienced significant gains today as investors responded positively to coordinated policy signals from major central banks. The Federal Reserve indicated a potential pause in rate hikes, while the European Central Bank suggested similar measures to support economic growth. This coordinated approach has boosted investor confidence across global markets, with technology and financial sectors leading the rally. Economic indicators show strengthening consumer spending and business investment, supporting the case for continued market optimism.",
      "imageUrl": "/uploads/1756559423016-v27bz8brk6f.jpg",
      "tags": [
        "business",
        "finance",
        "markets"
      ]
    },
    "mock-business-2": {
      "title": "Tech Giants Report Record Quarterly Earnings",
      "excerpt": "Leading technology companies exceed analyst expectations with strong revenue growth driven by cloud services and AI investments. Microsoft reported 15% year-over-year growth, while Google's parent company Alphabet saw 12% increase in advertising revenue. Amazon's AWS division continues to dominate cloud infrastructure with 32% market share, contributing significantly to overall profitability.",
      "content": "The latest earnings season has delivered impressive results for major technology corporations, with cloud computing and artificial intelligence driving unprecedented growth. Microsoft's Azure platform grew 29% year-over-year, while its productivity suite benefited from hybrid work trends. Google's search advertising revenue rebounded strongly, and YouTube's creator economy generated $8.1 billion in revenue. These results demonstrate the resilience of tech companies and their ability to adapt to changing market conditions while investing heavily in future technologies.",
      "imageUrl": "blob:http://localhost:3000/2016dedc-dffb-464a-afbe-d651e0eb63f6",
      "tags": [
        "business",
        "technology",
        "earnings"
      ]
    },
    "mock-tech-5": {
      "title": "Virtual Reality Transforms Educational Experiences",
      "excerpt": "Immersive VR technology revolutionizes classroom learning with interactive simulations and virtual field trips to historical sites. Students can now explore ancient Rome, conduct virtual chemistry experiments, and practice surgical procedures in risk-free environments. Over 500 schools have reported 40% improvement in student engagement and 25% better retention rates using VR-enhanced curricula.",
      "content": "Educational institutions are embracing virtual reality to create engaging learning environments that transcend traditional classroom limitations, allowing students to experience historical events firsthand and manipulate complex scientific concepts in three-dimensional space. The technology has proven particularly effective in STEM education, where abstract concepts become tangible through immersive visualization. Major educational publishers are investing heavily in VR content development, with the market expected to reach $13 billion by 2025.",
      "imageUrl": "https://images.unsplash.com/photo-1592478411213-6153e4ebc696?w=1200&h=800&fit=crop&q=80",
      "tags": [
        "technology",
        "vr",
        "education"
      ]
    },
    "mock-tech-4": {
      "title": "Cybersecurity Advances Combat Rising Digital Threats",
      "excerpt": "Next-generation security protocols and AI-powered threat detection systems provide enhanced protection against sophisticated cyber attacks. Zero-trust architecture implementations have reduced successful breaches by 78% across enterprise networks. Machine learning algorithms now identify and neutralize threats 15 times faster than traditional signature-based systems, adapting to new attack vectors in real-time.",
      "content": "The cybersecurity landscape continues to evolve with innovative defense mechanisms that leverage artificial intelligence and behavioral analysis to stay ahead of increasingly sophisticated threat actors. Organizations are implementing comprehensive security frameworks that assume no implicit trust and verify every transaction. Government agencies and private sector leaders are collaborating on new standards that will define cybersecurity best practices for the next decade.",
      "imageUrl": "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?w=1200&h=800&fit=crop&q=80",
      "tags": [
        "technology",
        "cybersecurity",
        "ai"
      ]
    }
  },
  "heroSlides": [
    {
      "id": "1",
      "title": "Philippines Achieves Record Renewable Energy Growth",
      "excerpt": "The Department of Energy reports unprecedented 794.34 MW of renewable energy capacity added in 2024, marking a historic milestone that surpasses the combined achievements of the previous three years as the nation accelerates its ambitious clean energy transition.",
      "imageUrl": "/uploads/1756944226198-z36cvfa3tyc.jpg",
      "category": "Technology",
      "author": "Department of Energy",
      "publishedAt": "2024-01-15T10:00:00.000Z",
      "views": 25420,
      "slug": "philippines-achieves-record-renewable-energy-growth"
    },
    {
      "id": "2",
      "title": "UAE Giant Masdar Enters Philippine Market",
      "excerpt": "International renewable energy leader Masdar has officially signed a comprehensive implementation agreement to develop an impressive 1 GW portfolio of solar, wind and advanced battery storage systems by 2030, directly supporting the Philippines ambitious Energy Transition Program goals.",
      "imageUrl": "https://images.unsplash.com/photo-1466611653911-95081537e5b7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1920&h=1080&q=80",
      "category": "Environment",
      "author": "Energy News Asia",
      "publishedAt": "2024-01-15T08:00:00.000Z",
      "views": 18750,
      "slug": "uae-giant-masdar-enters-philippine-market"
    },
    {
      "id": "3",
      "title": "Philippines Sets Bold Clean Energy Targets",
      "excerpt": "The government has unveiled ambitious plans to dramatically increase solar power share to 5.6% and quadruple wind power capacity to 11.7% by 2030, positioning the Philippines to potentially achieve one of the cleanest and most sustainable energy grids in Southeast Asia.",
      "imageUrl": "https://images.unsplash.com/photo-1548337138-e87d889cc369?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1920&h=1080&q=80",
      "category": "Business",
      "author": "Mylene Capongcol",
      "publishedAt": "2024-01-15T06:00:00.000Z",
      "views": 22150,
      "slug": "philippines-sets-bold-clean-energy-targets"
    }
  ]
}